{
	"products": [
		{
			"id": 1,
			"name": "13 inç MacBook Pro",
			"description": "Apple M1 çip, 13 inç MacBook Pro’ya inanılmaz bir hız ve güç kazandırıyor. 2,8 kata kadar daha yüksek CPU performansı. 5 kata kadar daha hızlı grafik teknolojileri. En gelişmiş Neural Engine birimimiz sayesinde 11 kata kadar daha hızlı yapay öğrenme. Ve gün boyunca devam etmenizi sağlayan 20 saate kadar pil ömrü. En sevilen profesyonel dizüstü bilgisayarımız şimdi bambaşka bir seviyede.",
			"productImage": "/images/macbook-pro.jpeg",
			"price": 17499,
			"category": 1,
			"isFavorite": true
		},
		{
			"id": 2,
			"name": "64GB iPad",
			"description": "True Tone özellikli 10.2 inç Retina ekran olağanüstü ayrıntılar, canlı renkler ve rahat bir görüntüleme deneyimi sunuyor.",
			"productImage": "/images/64gb-ipad.jpeg",
			"price": 4799,
			"category": 1,
			"isFavorite": false
		},
		{
			"id": 3,
			"name": "iPhone 13 Pro",
			"description": "Kameramızda bugüne kadarki en büyük gelişme. Yepyeni Pro kamera sistemi. Gelişmiş loş ışık performansı. Makro çekimle inanılmaz ayrıntılar.",
			"productImage": "/images/iphone-13.png",
			"price": 19999,
			"category": 1,
			"isFavorite": false
		},
		{
			"id": 4,
			"name": "Regular - Tar",
			"description": "Kaft'ın en sade hali. Aynı kalıp, aynı kumaş, aynı kalitedeki tişörtü dilersen desensiz basic olarak da alabilirsin.",
			"productImage": "/images/kaft-regular-tar.jpg",
			"price": 105,
			"category": 2,
			"isFavorite": false
		},
		{
			"id": 5,
			"name": "Relax - Off White",
			"description": "Modern bir tasarım çizgisinde, oversize ve rahat bir kullanım için hazırlandı.\nRegular kalıp tişörtlere oranla daha kalın bir kumaşa sahip olmasına rağmen yüksek hava geçirgenliği sayesinde ferah bir kullanım sunar.",
			"productImage": "/images/kaft-relax-off-white.jpg",
			"price": 125,
			"category": 2,
			"isFavorite": true
		},
		{
			"id": 6,
			"name": "Kendine İyi Davran Güzel İnsan",
			"description": "Sen kendin için bir şey yapmıyorsan kim senin için bir şeyler yapacak? Sen kendi yaralarını kendin sarmadan, kim sana yardım edebilir gerçekten? Eğer başkaları için önemli olmadığını hissediyorsan, ilkönce kendine şunu sormalısın: Ben kendim için önemli miyim?\nSeninle bir yolculuğa çıkacağız bu kitapla birlikte. Her insanın içinde bir sağlıklı bir de sağlıksız bir “ben” vardır. Sağlıksız ben kontrolü devraldığında, insan kendine zarar verir. İşte bu kitapla çıkacağımız yolculuğun amacı, içindeki güzel insana yani sağlıklı bene ulaşmak.\nBu yolculukta, kaygılarınla baş etmek ve kafaya takmamak için hangi yöntemleri kullanabileceğini, olumsuz düşüncelerini nasıl kontrol edebileceğini, sağlıklı ilişkilerini geliştirirken, sana zarar veren zehirli insanlardan kendini nasıl koruyabileceğini, hangi alanlarda mücadele etmenin anlamlı olduğunu, hangi alanlarda hayatı ve getirdiklerini kabullenmen gerektiğini, içindeki değersizlik hissini nasıl yenebileceğini ve kendini nasıl dönüştürebileceğini keşfedeceksin.\nHazır mısın bu yolculuğa?",
			"productImage": "/images/kendine-iyi-davran-guzel-insan.jpg",
			"price": 15.6,
			"category": 3,
			"isFavorite": true
		},
		{
			"id": 7,
			"name": "Ne İçin Varsan Onun İçin Yaşa - Bir Arayışın Romanı",
			"description": "“Tüm muhteşem hikâyeler iki şekilde başlar. Ya bir insan bir yolculuğa çıkar ya da şehre bir yabancı gelir.”\n- Tolstoy\nDemirden keskin bir düdük sesi yükseldi o sırada. Ayrılığın ciddiyeti buz gibi sardı bedenimi. Kapılar kapandı sonra... Çantam sağımda, yalnızlık karşımda...\nGidiyorum!\nHayır bir saniye!\nFilmlerde böyle olmazdı ki... Son anda muhakkak bir kalma sebebi yazardı senarist. Tam hareket etmek üzereyken trenden atlayıverirdi esas adam.\nOysa şimdi rayların üzerinde kaymaya başlamıştı bile tren... Ayrılığın göğsüme oturan ağırlığıyla camdan dışarı bakıp el sallayan insanlarla dolu peronu izledim.\nBeni uğurlamaya gelmeyen herkese teşekkür eder gibi bir damla gözyaşı bıraktım oraya.",
			"productImage": "/images/ne-icin-varsan-onun-icin-yasa.jpg",
			"price": 16.8,
			"category": 3,
			"isFavorite": true
		},
		{
			"id": 8,
			"name": "Bilinmeyen Bir Kadının Mektubu",
			"description": "Stefan Zweig Bilinmeyen Bir Kadının Mektubu (Brief einer Unbekannten) adlı uzun öyküsünü 1920'li yılların ilk yarısında kaleme aldı. Bilinmeyen Bir Kadının Mektubu'nun kadın kahramanını sadece uzun bir mektubun yazarı olarak tanıyoruz. Kadının hayatı boyunca sevmiş olduğu erkek için kaleme aldığı bu mektubun \"gönderen\"inin adı yoktur. Mektubun başında tek bir hitap vardır: \"Sana, beni asla tanımamış olan sana\". Kadın büyük tutkusunu hep bir \"bilinmeyen\" olarak, yani tek başına yaşamaya razıdır, bu aşk öyküsünde \"taraflar\" değil, sadece tek bir \"taraf\" vardır. Böylesine, gerçek anlamda aşk denilebilir mi? Zweig okurunu, bir kez daha, insan psikolojisinde eşine pek rastlanmayan bir yolculuğa davet ediyor. Bu yeni yolculuğun sonunda \"mutlak aşk\" kavramının şimdiye kadar bilinmeyen kıyılarına varmayı amaçlamış olması da bir ihtimal!",
			"productImage": "/images/bilinmeyen-bir-kadinin-mektubu.jpg",
			"price": 3.9,
			"category": 3,
			"isFavorite": true
		}
	],
	"categories": [
		{
			"id": 1,
			"name": "Elektronik",
			"description": "Herkes için elektronik."
		},
		{
			"id": 2,
			"name": "Moda",
			"description": "Herkes için moda."
		},
		{
			"id": 3,
			"name": "Kitap",
			"description": "Herkes için kitap."
		}
	],
	"sliders": [
		{
			"productId": 6,
			"image": "/images/dr-slider.jpg"
		},
		{
			"productId": 1,
			"image": "/images/apple-slider.png"
		},
		{
			"productId": 4,
			"image": "/images/kaft-slider.png"
		}
	]
}
